c5/src/Documents/Payroll/Payroll.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Payroll</name>
  <registerRecords>AccountingRegister.General</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DateStart</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Dirty</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Period</name>
    <type>
      <types>EnumRef.TimesheetPeriods</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Base</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Bonuses</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Days</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.Vacation</types>
        <types>DocumentRef.SickLeave</types>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Period</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ScheduledDays</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Compensations</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountingResult</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BaseAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BaseAnnualBonuses</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BaseDays</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BaseHolidays</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BasePeriod</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BaseQuarterlyBonuses</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BaseScheduledDays</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Bonuses</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Compensation</name>
      <type>
        <types>ChartOfCalculationTypesRef.Compensations</types>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>DailyRate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DateEnd</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>DateStart</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Days</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Edit</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Expenses</name>
      <type>
        <types>CatalogRef.ExpenseMethods</types>
      </type>
    </attributes>
    <attributes>
      <name>Holidays</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>HourlyRate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Hours</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Individual</name>
      <type>
        <types>CatalogRef.Individuals</types>
      </type>
    </attributes>
    <attributes>
      <name>InHand</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Insurance</name>
      <type>
        <types>ChartOfCalculationTypesRef.Taxes</types>
      </type>
    </attributes>
    <attributes>
      <name>Position</name>
      <type>
        <types>CatalogRef.Positions</types>
      </type>
    </attributes>
    <attributes>
      <name>Rate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Reference</name>
      <type>
        <types>DocumentRef.Vacation</types>
        <types>DocumentRef.SickLeave</types>
        <types>DocumentRef.Timesheet</types>
      </type>
    </attributes>
    <attributes>
      <name>Result</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Schedule</name>
      <type>
        <types>CatalogRef.Schedules</types>
      </type>
    </attributes>
    <attributes>
      <name>ScheduledDays</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ScheduledHours</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SeniorityAmendment</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Taxes</name>
    <attributes>
      <name>Account</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Base</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DateEnd</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>DateStart</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Edit</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Expenses</name>
      <type>
        <types>CatalogRef.ExpenseMethods</types>
      </type>
    </attributes>
    <attributes>
      <name>Individual</name>
      <type>
        <types>CatalogRef.Individuals</types>
      </type>
    </attributes>
    <attributes>
      <name>Method</name>
      <type>
        <types>EnumRef.Calculations</types>
      </type>
    </attributes>
    <attributes>
      <name>Result</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Tax</name>
      <type>
        <types>ChartOfCalculationTypesRef.Taxes</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Totals</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Individuals</types>
      </type>
    </attributes>
    <attributes>
      <name>Other</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Social</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Enums/Calculations/Calculations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Calculations</name>
  <enumValues>
    <name>Absence</name>
  </enumValues>
  <enumValues>
    <name>Amount</name>
  </enumValues>
  <enumValues>
    <name>Annual</name>
  </enumValues>
  <enumValues>
    <name>Banked</name>
  </enumValues>
  <enumValues>
    <name>BankedUse</name>
  </enumValues>
  <enumValues>
    <name>ChildCare</name>
  </enumValues>
  <enumValues>
    <name>CompensationPercent</name>
  </enumValues>
  <enumValues>
    <name>DailyPercent</name>
  </enumValues>
  <enumValues>
    <name>DayOff</name>
  </enumValues>
  <enumValues>
    <name>EveningHours</name>
  </enumValues>
  <enumValues>
    <name>ExtendedVacation</name>
  </enumValues>
  <enumValues>
    <name>ExtraChildCare</name>
  </enumValues>
  <enumValues>
    <name>FixedAmount</name>
  </enumValues>
  <enumValues>
    <name>IncomeTax</name>
  </enumValues>
  <enumValues>
    <name>HolidayHours</name>
  </enumValues>
  <enumValues>
    <name>HourlyRate</name>
  </enumValues>
  <enumValues>
    <name>MedicalInsurance</name>
  </enumValues>
  <enumValues>
    <name>MonthlyRate</name>
  </enumValues>
  <enumValues>
    <name>NightHours</name>
  </enumValues>
  <enumValues>
    <name>Overtime</name>
  </enumValues>
  <enumValues>
    <name>PaternityVacation</name>
  </enumValues>
  <enumValues>
    <name>Percent</name>
  </enumValues>
  <enumValues>
    <name>Quarterly</name>
  </enumValues>
  <enumValues>
    <name>SickDays</name>
  </enumValues>
  <enumValues>
    <name>SickDaysChild</name>
  </enumValues>
  <enumValues>
    <name>SickOnlySocial</name>
  </enumValues>
  <enumValues>
    <name>SickProduction</name>
  </enumValues>
  <enumValues>
    <name>SocialInsurance</name>
  </enumValues>
  <enumValues>
    <name>Vacation</name>
  </enumValues>
  <enumValues>
    <name>VacationWithoutPay</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/Payroll/Forms/Row/Module.bsl
&AtClient
var TableRow export;
&AtClient
var SelectedValue;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	loadParams ();
	Options.Company ( ThisObject, Object.Company );
	readAppearance ();
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|GroupVacation show inlist ( Method, Enum.Calculations.ExtendedVacation, Enum.Calculations.Vacation );
	|GroupSickLeave show inlist ( Method, Enum.Calculations.SickDays, Enum.Calculations.SickDaysChild, Enum.Calculations.SickOnlySocial, Enum.Calculations.SickProduction );
	|PageFields Employee Reference enable-unlock Edit;
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure loadParams ()
	
	Object.Company = Parameters.Company;
	NewRow = Parameters.row;
	ReadOnly = Parameters.ReadOnly;
	
EndProcedure 

&AtClient
Procedure OnOpen ( Cancel )
	
	loadData ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtClient
Procedure loadData ()
	
	owner = FormOwner.Object;
	Object.Date = owner.Date;
	TableRow = Object.Compensations.Add ();
	FillPropertyValues ( TableRow, FormOwner.Items.Compensations.CurrentData );
	TableRow.Edit = NewRow or TableRow.Edit;
	Edit = TableRow.Edit;
	setMethod ();
	
EndProcedure 

&AtClient
Procedure setMethod ()
	
	compensation = TableRow.Compensation;
	if ( compensation.IsEmpty () ) then
		Method = undefined;
	else
		Method = DF.Pick ( TableRow.Compensation, "Method" );
	endif;
	
EndProcedure 

&AtClient
Procedure BeforeClose ( Cancel, Exit, MessageText, StandardProcessing )
	
	if ( SelectedValue = undefined ) then
		Cancel = true;
		pickValue ( Enum.ChoiceOperationsPayrollRecord (), undefined );
	endif;
	
EndProcedure

&AtClient
Procedure pickValue ( Operation, Value )
	
	SelectedValue = new Structure ();
	SelectedValue.Insert ( "Operation", Operation );
	SelectedValue.Insert ( "Value", Value );
	SelectedValue.Insert ( "row", Parameters.NewRow );
	#if ( WebClient ) then
		// Bug workaround 8.3.14.1592. NotifyChoice () will not close the form.
		// Idle handler is required
		AttachIdleHandler ( "startChoosing", 0.01, true );
	#else
		NotifyChoice ( SelectedValue );
	#endif
	
EndProcedure

&AtClient
Procedure startChoosing ()
	
	NotifyChoice ( SelectedValue );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure OK ( Command )
	
	applyCommand ( Enum.ChoiceOperationsPayrollRecord () );

EndProcedure

&AtClient
Procedure applyCommand ( Command )
	
	FormOwner.Modified = true;
	pickValue ( Command, TableRow );
	
EndProcedure 

&AtClient
Procedure SaveAndNew ( Command )
	
	applyCommand ( Enum.ChoiceOperationsPayrollRecordSaveAndNew () );
	
EndProcedure

&AtClient
Procedure EmployeeOnChange ( Item )
	
	HiringForm.SetIndividual ( TableRow );
	
EndProcedure

&AtClient
Procedure EditOnChange ( Item )
	
	Edit = Object.Compensations [ 0 ].Edit;
	Appearance.Apply ( ThisObject, "Edit" );
	
EndProcedure

&AtClient
Procedure CompensationOnChange ( Item )
	
	setMethod ();
	resetReference ();
	Appearance.Apply ( ThisObject, "Method" );
	
EndProcedure

&AtClient
Procedure resetReference ()
	
	if ( Method = PredefinedValue ( "Enum.Calculations.SickDays" )
		or Method = PredefinedValue ( "Enum.Calculations.ExtendedVacation" )
		or Method = PredefinedValue ( "Enum.Calculations.Vacation" ) ) then
		return;
	endif;
	TableRow.Reference = undefined;
	
EndProcedure
